cases/column_x8_coarse_LES/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{	
    upperwall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
	
	lowerwall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
	
	column
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
	
    inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
	
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
	
    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
